{
    "es": {
        "about": "## Perfil Profesional\nSoy un apasionado de la tecnolog铆a, con un profundo inter茅s en la computaci贸n, la inteligencia artificial y las telecomunicaciones. Militar profesional desde 2001, he desarrollado mi trayectoria profesional en 谩mbitos como la seguridad y en Operaciones Especiales, adquiriendo una experiencia multidisciplinar que me permite comprender de manera hol铆stica el empleo de la tecnolog铆a en contextos t谩cticos y situaciones de crisis. Poseo amplios conocimientos en administraci贸n de sistemas, redes y desarrollo de software, as铆 como en sistemas de informaci贸n y comunicaciones militares.",
        "experience": "## Experiencia Laboral\n- **Fuerzas Armadas (Armada Espa帽ola):**\n  - 2001 - Presente: Militar profesional.\n  - 2001 - 2010: Componente de la Fuerza de Protecci贸n de la Armada, desempe帽ando tareas relacionadas con la seguridad f铆sica de medios e instalaciones de la Armada.\n  - 2010 - 2021: Miembro de la FGNE (Fuerza de Guerra Naval Especial), desempe帽ando distintos roles, incluido operador de sistemas t谩cticos de telecomunicaciones e informaci贸n en el 谩mbito de las operaciones especiales.\n\n- **Administrador de sistemas e infraestructura:**\n  - Gesti贸n de entornos basados en **Active Directory (AD):** configuraci贸n, administraci贸n y mantenimiento de usuarios, pol铆ticas y servicios.\n  - Experiencia en sistemas **Linux**, tanto en cliente como en servidor, y en soluciones de virtualizaci贸n (Proxmox, VMware).\n  - Implementaci贸n y mantenimiento de sistemas de informaci贸n y comunicaciones militares.",
        "skills": "## Habilidades T茅cnicas\n### Sistemas Operativos\n- **Linux/Unix:** Experiencia avanzada con distribuciones como Ubuntu, CentOS y Red Hat, incluyendo administraci贸n de servidores, scripting en Bash y automatizaci贸n de tareas.\n- **Windows Server:** Gesti贸n avanzada de Active Directory, pol铆ticas de grupo (Group Policies) y configuraci贸n de roles cr铆ticos como DNS, DHCP, y servidores web (IIS).\n- **MacOS:** Experiencia en administraci贸n y soporte de infraestructuras basadas en Mac en entornos corporativos mixtos.\n\n### Redes\n- **Configuraci贸n de Redes:** Gesti贸n avanzada de dispositivos de red de marcas l铆deres como Cisco y MikroTik.\n- **Protocolos y Seguridad:** Conocimiento en TCP/IP, DNS, DHCP, FTP, SMTP, HTTP/HTTPS, SNMP, adem谩s de configuraci贸n de firewalls (Fortinet, Palo Alto, Cisco ASA) y sistemas de detecci贸n de intrusiones (IDS/IPS).\n- **Resoluci贸n de Problemas:** Uso de herramientas como Wireshark, tcpdump, traceroute, y Nmap para an谩lisis y diagn贸stico de redes.\n- **VPNs:** Implementaci贸n y administraci贸n de tecnolog铆as avanzadas como IPsec, OpenVPN, WireGuard y SSL VPN en soluciones como FortiGate, OpenVPN Access Server, y OpnSense.\n\n### Virtualizaci贸n y Cloud\n- **Hypervisores:** Experiencia con VMware vSphere/ESXi, Microsoft Hyper-V y Proxmox para entornos de virtualizaci贸n.\n- **Contenedores y Orquestaci贸n:** Uso de Docker y Kubernetes para la implementaci贸n de aplicaciones escalables y administraci贸n de infraestructuras modernas.\n- **Soluciones Cloud:** Familiaridad con servicios de redes y sistemas virtualizados en AWS, Azure y Google Cloud.\n\n### Ingenier铆a de Software\n- **Lenguajes de Programaci贸n:** Experiencia s贸lida en C/C++, Rust y Python para desarrollo de software. Conocimientos intermedios en Java y Frameworks como Spring.",
        "education": "## Formaci贸n Acad茅mica\n- **Grado en Ingenier铆a de Tecnolog铆as y Servicios de Telecomunicaci贸n (en curso):**\n  - Menci贸n en Sistemas Telem谩ticos.\n  - Menci贸n en Sistemas de Telecomunicaci贸n.\n- **Ciclo Formativo de Grado Superior (CFGS):**\n  - Desarrollo de Aplicaciones Multiplataforma (DAM).\n  - Administraci贸n de Sistemas Inform谩ticos en Red (ASIR).",
        "contact": "## Contacto\n [Operador_rata@pm.me](mailto:Operador_rata@pm.me)"
    },
    "en": {
        "about": "## Professional Profile\nI am a technology enthusiast with a deep passion for computing, artificial intelligence, and telecommunications. A professional military member since 2001, I have developed my career in areas such as security and Special Operations, gaining multidisciplinary experience that enables me to understand the holistic application of technology in tactical environments and crisis situations. I possess extensive knowledge in systems administration, networking, and software development, as well as expertise in military information and communication systems.",
        "experience": "## Work Experience\n- **Armed Forces (Spanish Navy):**\n  - 2001 - Present: Professional military member.\n  - 2001 - 2010: Member of the Navy Protection Force, performing tasks related to physical security of Navy assets and facilities.\n  - 2010 - 2021: Member of the FGNE (Special Naval Warfare Force), taking on various roles, including tactical telecommunications and information systems operator within the scope of special operations.\n\n- **Systems and Infrastructure Administrator:**\n  - Managed **Active Directory (AD)** environments: configuration, administration, and maintenance of users, policies, and services.\n  - Extensive experience with **Linux** systems, both client and server, as well as virtualization solutions (Proxmox, VMware).\n  - Implemented and maintained military information and communication systems.",
        "skills": "## Technical Skills\n### Operating Systems\n- **Linux/Unix:** Advanced experience with distributions such as Ubuntu, CentOS, and Red Hat, including server administration, Bash scripting, and task automation.\n- **Windows Server:** Advanced management of Active Directory, Group Policies, and critical roles such as DNS, DHCP, and IIS.\n- **MacOS:** Experience in managing and supporting Mac-based infrastructures in mixed corporate environments.\n\n### Networking\n- **Network Configuration:** Advanced management of networking devices from industry leaders such as Cisco, Juniper, and MikroTik.\n- **Protocols and Security:** Proficient in TCP/IP, DNS, DHCP, FTP, SMTP, HTTP/HTTPS, SNMP, as well as firewall configuration (Fortinet, Palo Alto, Cisco ASA) and intrusion detection systems (IDS/IPS).\n- **Troubleshooting:** Expert use of tools like Wireshark, tcpdump, traceroute, and Nmap for network analysis and diagnostics.\n- **VPNs:** Implementation and management of advanced technologies like IPsec, OpenVPN, WireGuard, and SSL VPN with solutions such as FortiGate, OpenVPN Access Server, and OpnSense.\n\n### Virtualization and Cloud\n- **Hypervisors:** Proficient in VMware vSphere/ESXi, Microsoft Hyper-V, and Proxmox for virtualization environments.\n- **Containers and Orchestration:** Expertise in Docker and Kubernetes for scalable application deployment and modern infrastructure management.\n- **Cloud Solutions:** Familiarity with networking and virtual systems services in AWS, Azure, and Google Cloud.\n\n### Software Engineering\n- **Programming Languages:** Strong experience in C/C++, Rust, and Python for software development. Intermediate knowledge of Java and frameworks like Spring.",
        "education": "## Education\n- **Bachelors Degree in Telecommunication Technologies and Services Engineering (in progress):**\n  - Specialization in Telematic Systems.\n  - Specialization in Telecommunication Systems.\n- **Advanced Vocational Training (CFGS):**\n  - Multi-platform Application Development (DAM).\n  - Networked Systems Administration (ASIR).",
        "contact": "## Contact Information\n [Operador_rata@pm.me](mailto:Operador_rata@pm.me)"
    }
}